"""
Написать программу, которая генерирует в указанных пользователем границах: ● случайное целое число,
● случайное вещественное число, ● случайный символ. Для каждого из трех случаев пользователь задает свои границы
диапазона. Например, если надо получить случайный символ от 'a' до 'f', то вводятся эти символы. Программа должна
вывести на экран любой символ алфавита от 'a' до 'f' включительно.

"""
import random from random
print("Введите диапазоны для поиска случайного значения")
a_r1 = int(input("Введите первое целое число: "))
a_r2 = int(input("Введите второе целое число: "))
b_r1 = (input("Введите первое вещественное число: "))
b_r2 = (input("Введите второе вещественное число: "))
sim_r1 = (input("Введите первый символ: "))
sim_r2 = (input("Введите второй символ: "))


